# -*- coding: utf-8 -*-

# Теперь немного умных слов

# Класс(Class): Определенный программистом прототип программируемого
# объекта с набором атрибутов(переменных и методов), которые описывают
# данный объект. Доступ к аттрибутам и методам осуществляется через точку

# Переменная класса(Class variable): Переменная, доступная для всех экземпляров данного
# класса. Определяется внутри класса, но вне любых методов класса.

# Экземпляр класса(Instance): Отдельный объект - представитель определенного класса.

# Переменная экземпляра класса(Instance variable): Переменная определенная внутри
# медота класса, принадлежащая только к этому классу.

# Метод(Method): Особая функция, определенная внутри класса.

# Наследование(Inheritance): Передача аттрибутов и методов родительского класса дочерним
# классам.

# Перегрузка функций(Function overloading): Изменение работы метода, унаследованного
# дочерним классом от родительского класса.

# Перегрузка операторов(Operator overloading): Определение работы операторов  с экземплярами
# данного класса.


# Если хочется еще крутой теории - https://goo.gl/9JxMcn

# Изученные нами принципы ООП
#   абстракция - выделение классов обьектов
#   наследование - иерархия классов
#   инкапсуляция - сокрытие данных внутри обьекта
#   полиморфизм - множественное наследование
