# -*- coding: utf-8 -*-

# „Скомпилированные“ файлы Python - .pyc

# Интерпретатор Python применяет один важный приём для ускорения запуска программы:
# если в каталоге __pycache__, где располагается файл с некоторым модулем spam.py,
# находится также файл spam.pyc, предполагается, что это уже скомпилированная
# в байт-код («byte-compiled») версия модуля spam. В файле spam.pyc зафиксировано
# время изменения файла spam.py версии, использовавшейся для создания spam.pyc.
# Если версии не совпадают — файл .pyc игнорируется.

# Если сценарий запущен за счёт передачи его имени командной строке,
# > python -m module_1
# его байт-код никогда не будет записан в файл .pyc

# Можно распространять библиотеки кода Python в том виде,
# из которого трудно восстановить исходный код.
